src/cf/Enums/ВидыЦенностей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыЦенностей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АвансыВыданные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвансыПолученные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвансыПолученные0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееПотребление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратАвансовПолученных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмуществоСУчетомНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомандировочныеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентАренда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентРеализацияИмущества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентИностранцы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентЭлектронныеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентКомитент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НМА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъектыНезавершенногоСтроительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПосредническиеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредставительскиеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРаботыИУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СМРПодрядные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СМРСобственнымиСилами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммыСвязанныеСРасчетамиПоОплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаможенныеПлатежи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаможенныеПлатежиОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыУслугиКомитентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаможенныйСоюз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыНесырьевые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыНалоговыйАгент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвансыВыданныеНалоговыйАгент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвансыПолученныеНалоговыйАгент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратАвансовПолученныхНалоговыйАгент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиНеНаТерриторииРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СМРПодрядныеКапстроительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапстроительствоНезавершенныхОбъектов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыФизлицамВЕАЭСЭлектронныеПлощадки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыЦенностей/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает массив видов ценностей, относящихся к операциям налогового агента по НДС.
// Параметры:
//     ВключаяКомиссионныеОперации - Булево - признак необходимости включения в состав возвращаемого массива
//                                            операций реализации ценностей комитента-нерезидента.
//     ВключаяОбратноеНачисление   - Булево - признак необходимости включения в состав возвращаемого массива
//                                            операций реализации товаров п.8 ст. 161 НК.
// Возвращаемое значение: 
//     Массив - массив значений вида ПеречислениеСсылка.ВидыЦенностей.
Функция МассивВидовЦенностиНалоговыйАгент(
		ВключаяКомиссионныеОперации = Истина, ВключаяОбратноеНачисление = Ложь) Экспорт
	
	ВидыЦенностей = Новый Массив;
	ВидыЦенностей.Добавить(НалоговыйАгентАренда);
	ВидыЦенностей.Добавить(НалоговыйАгентИностранцы);
	ВидыЦенностей.Добавить(НалоговыйАгентРеализацияИмущества);
	ВидыЦенностей.Добавить(НалоговыйАгентЭлектронныеУслуги);
	
	Если ВключаяКомиссионныеОперации Тогда
		ВидыЦенностей.Добавить(НалоговыйАгентКомитент);
	КонецЕсли;
	
	Если ВключаяОбратноеНачисление Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
			ВидыЦенностей,
			МассивВидовЦенностиНалоговыйАгентРеализацияТоваров());
	КонецЕсли;
	
	Возврат ВидыЦенностей;
	
КонецФункции

// Возвращает массив видов ценностей, относящихся к операциям налогового агента при покупке товаров,
// указанных в п.8 ст. 161 НК РФ.
// Возвращаемое значение: 
//     Массив - массив значений вида ПеречислениеСсылка.ВидыЦенностей.
Функция МассивВидовЦенностиНалоговыйАгентРеализацияТоваров() Экспорт
	
	ВидыЦенностей = Новый Массив;
	ВидыЦенностей.Добавить(АвансыВыданныеНалоговыйАгент);
	ВидыЦенностей.Добавить(АвансыПолученныеНалоговыйАгент);
	ВидыЦенностей.Добавить(ВозвратАвансовПолученныхНалоговыйАгент);
	ВидыЦенностей.Добавить(ТоварыНалоговыйАгент);
	
	Возврат ВидыЦенностей;
	
КонецФункции

// Возвращает массив видов ценностей, относящихся к услугам и доп. расходам.
//
// Возвращаемое значение: 
//     Массив - массив значений вида ПеречислениеСсылка.ВидыЦенностей.
//
Функция МассивВидовЦенностиУслугДляУчетаСебестоимости() Экспорт
	
	ВидыЦенностей = Новый Массив;
	ВидыЦенностей.Добавить(ПрочиеРаботыИУслуги);
	ВидыЦенностей.Добавить(ЭлектронныеУслуги);
	
	Возврат ВидыЦенностей;
	
КонецФункции

// Возвращает массив видов ценностей, по которым производится поиск счета-фактуры с учетом договора.
// Возвращаемое значение: 
//     Массив - массив значений вида ПеречислениеСсылка.ВидыЦенностей.
Функция МассивВидовЦенностейУчитывающихсяПоДоговорам() Экспорт
    
    ВидыЦенностей = Новый Массив;
    ВидыЦенностей.Добавить(АвансыВыданные);
    ВидыЦенностей.Добавить(АвансыПолученные);
    ВидыЦенностей.Добавить(АвансыПолученные0);
    ВидыЦенностей.Добавить(ВозвратАвансовПолученных);
    
    ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
        ВидыЦенностей,
        МассивВидовЦенностиНалоговыйАгент());
        
    ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
        ВидыЦенностей,
        МассивВидовЦенностиНалоговыйАгентРеализацияТоваров());
        
    Возврат ВидыЦенностей;
    
КонецФункции

// Определяет, производится ли поиск счета-фактуры по переданному виду ценности с учетом договора.
// Параметры
//     ВидЦенности - ПеречислениеСсылка.ВидыЦенностей.
// Возвращаемое значение: 
//     Булево - Истина - вид ценности учитывается по договорам,
//              Ложь - вид ценности не учитывается по договорам.
Функция УчитываетсяПоДоговорам(ВидЦенности) Экспорт
    
    ВидыЦенностейУчитывающиесяПоДоговорам = МассивВидовЦенностейУчитывающихсяПоДоговорам();
    Возврат ВидыЦенностейУчитывающиесяПоДоговорам.Найти(ВидЦенности) <> Неопределено;
    
КонецФункции


// Определяет, относится ли переданный вид ценности к операциям налогового агента по НДС.
// Параметры
//     ВидЦенности - ПеречислениеСсылка.ВидыЦенностей.
// Возвращаемое значение: 
//     Булево - Истина - вид ценности относится к операциям налогового агента по НДС,
//              Ложь - вид ценности не относится к операциям налогового агента по НДС.
Функция ЭтоНалоговыйАгент(ВидЦенности) Экспорт
    
    ВидыЦенностейНалоговогоАгента = МассивВидовЦенностиНалоговыйАгент();
    Возврат ВидыЦенностейНалоговогоАгента.Найти(ВидЦенности) <> Неопределено;
    
КонецФункции
#КонецОбласти

#КонецЕсли
